{"text": "The Receiving Party agrees to hold in confidence and not disclose to any third party any Confidential Information disclosed by the Disclosing Party. The Receiving Party shall use the Confidential Information solely for the purpose of evaluating a potential business relationship between the parties. This obligation shall survive termination of this Agreement for a period of five (5) years.", "label": "confidentiality"}
{"text": "The Receiving Party shall strictly maintain the confidentiality of the Proprietary Information. Proprietary Information may be shared only with Receiving Party's employees who need to know such information for the purpose of performing obligations under this Agreement and who are bound by written confidentiality obligations at least as restrictive as those herein. The Receiving Party shall not reverse engineer, disassemble, or decompile any prototypes, software, or other tangible objects which embody the Proprietary Information.", "label": "confidentiality"}
{"text": "Upon the termination or expiration of this Agreement, or upon the Disclosing Party's earlier request, the Receiving Party shall promptly return to the Disclosing Party or, at the Disclosing Party's option, destroy all Confidential Information and any copies, extracts, or derivatives thereof. The Receiving Party shall provide a written certification of such return or destruction signed by an authorized officer of the Receiving Party within ten (10) days of such compliance.", "label": "confidentiality"}
{"text": "Upon the termination or expiration of this Agreement, or upon the Disclosing Party's earlier request, the Receiving Party shall promptly return to the Disclosing Party or, at the Disclosing Party's option, destroy all Confidential Information and any copies, extracts, or derivatives thereof. The Receiving Party shall provide a written certification of such return or destruction signed by an authorized officer of the Receiving Party within ten (10) days of such compliance.", "label": "confidentiality"}
{"text": "This Agreement shall be governed by the laws of India. Any dispute arising out of or in connection with this Agreement, including any question regarding its existence, validity or termination, shall be referred to and finally resolved by arbitration in New Delhi in accordance with the Arbitration and Conciliation Act, 1996. The tribunal shall consist of a sole arbitrator appointed by mutual agreement of the Parties. The language of the arbitration shall be English.", "label": "dispute_resolution"}
{"text": "Neither Party shall be liable for any failure or delay in performance under this Agreement (other than for delay in the payment of money due and payable hereunder) to the extent said failures or delays are proximately caused by acts of God, government restrictions, wars, insurrections, fires, floods, storms, epidemics, or other causes beyond the reasonable control of such Party and to which it did not contribute.", "label": "force_majeure"}
{"text": "The Indemnifying Party shall defend, indemnify and hold harmless the Indemnified Party from any and all claims, damages, losses, liabilities, costs and expenses (including reasonable attorneys' fees) arising from the acts, omissions or negligence of the Indemnifying Party in the performance of services under this Agreement, except to the extent caused by the gross negligence or willful misconduct of the Indemnified Party.", "label": "indemnity"}
{"text": "Provider shall indemnify, defend and hold Customer harmless from and against any and all losses, damages, liabilities, costs (including reasonable attorneys' fees) (\"Losses\") incurred by Customer resulting from any third-party claim, suit, action or proceeding (\"Third-Party Claim\") that the Services, or any use of the Services in accordance with this Agreement, infringes or misappropriates such third party's intellectual property rights, provided that Customer promptly notifies Provider in writing of the claim, cooperates with Provider, and allows Provider sole authority to control the defense and settlement of such claim.", "label": "indemnity"}
{"text": "Each Party (the \"Indemnifying Party\") agrees to indemnify, defend, and hold harmless the other Party and its officers, directors, employees, and agents (the \"Indemnified Parties\") from and against any and all third-party claims, demands, losses, liabilities, and expenses (including reasonable legal fees) arising out of or relating to: (a) the Indemnifying Party's gross negligence or willful misconduct; or (b) the Indemnifying Party's material breach of its representations and warranties under this Agreement.", "label": "indemnity"}
{"text": "Seller agrees to indemnify and save Buyer harmless from any and all judgments, orders, decrees, awards, costs, expenses, including attorney's fees and settlements, and claims on account of damage to property or bodily injury (including death) which may be sustained by Buyer, Buyer's employees, or third parties, arising out of or in connection with any defect in the Goods sold hereunder or the use thereof, except to the extent caused by Buyer's negligence.", "label": "indemnity"}
{"text": "EXCEPT FOR A PARTY'S INDEMNIFICATION OBLIGATIONS OR BREACH OF CONFIDENTIALITY, NEITHER PARTY WILL BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOST PROFITS OR REVENUES, BUSINESS INTERRUPTION, OR LOSS OF BUSINESS INFORMATION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.", "label": "liability_limitation"}
{"text": "EXCEPT FOR A PARTY'S INDEMNIFICATION OBLIGATIONS OR BREACH OF CONFIDENTIALITY, NEITHER PARTY WILL BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOST PROFITS OR REVENUES, BUSINESS INTERRUPTION, OR LOSS OF BUSINESS INFORMATION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.", "label": "liability_limitation"}
{"text": "Either party may terminate this Agreement upon thirty (30) days' written notice to the other party. Upon termination, each party shall return or destroy all Confidential Information received from the other party. Sections 3, 5, and 7 shall survive any termination or expiration of this Agreement.", "label": "termination"}
{"text": "Either Party may terminate this Agreement immediately upon written notice if the other Party: (a) commits a material breach of this Agreement and fails to cure such breach within thirty (30) days after receiving written notice of the breach; (b) becomes the subject of a voluntary petition in bankruptcy or any voluntary proceeding relating to insolvency; or (c) ceases to conduct business in the ordinary course.", "label": "termination"}
{"text": "Upon expiration or termination of this Agreement for any reason, all rights and licenses granted to Licensee shall immediately cease, and Licensee shall immediately discontinue all use of the Licensed Software and return all copies to Licensor. Termination shall not relieve Licensee of its obligation to pay any fees accrued or payable to Licensor prior to the effective date of termination.", "label": "termination"}
